<a href="https://colab.research.google.com/github/karanjogi/Practice/blob/master/Lecture_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
df = pd.read_csv(filepath_or_buffer="/content/beauty.csv",
                 sep=';')

In [5]:
df.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [7]:
df['wage'].head()

0     5.73
1     4.28
2     7.96
3    11.57
4    11.42
Name: wage, dtype: float64

In [8]:
df.shape

(1260, 10)

In [9]:
df.columns

Index(['wage', 'exper', 'union', 'goodhlth', 'black', 'female', 'married',
       'service', 'educ', 'looks'],
      dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [12]:
df.describe()

              wage        exper  ...         educ        looks
count  1260.000000  1260.000000  ...  1260.000000  1260.000000
mean      6.306690    18.206349  ...    12.563492     3.185714
std       4.660639    11.963485  ...     2.624489     0.684877
min       1.020000     0.000000  ...     5.000000     1.000000
25%       3.707500     8.000000  ...    12.000000     3.000000
50%       5.300000    15.000000  ...    12.000000     3.000000
75%       7.695000    27.000000  ...    13.000000     4.000000
max      77.720000    48.000000  ...    17.000000     5.000000

[8 rows x 10 columns]